Day_2_first_routes_and_controllers/app/controllers/artworks_controller.rb

    def create
        @artwork = Artwork.new(artwork_params)

        if @artwork.save
---
INSERT INTO "artworks" ("title", "image_url", "artist_id") VALUES ($1, $2, $3) RETURNING "id"  [["title", "we did it"], ["image_url", "appacad"], ["artist_id", 1]]

    def update
        @artwork = Artwork.find(params[:id])
        if @artwork.update(artwork_params)
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "image_url" = $2, "artist_id" = $3 WHERE "artworks"."id" = $4  [["title", "we did it"], ["image_url", "appacad"], ["artist_id", 1], ["id", 5]]

    def destroy
        @artwork = Artwork.find(params[:id])
        @artwork.destroy
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 6]]