Day_2_first_routes_and_controllers/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email") VALUES ($1, $2) RETURNING "id"  [["name", "kyle"], ["email", "kyle123@gmail.com"]]
---
    def create
        @user = User.new(user_params)           #creates a new user instance
            if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1 WHERE "users"."id" = $2  [["email", "andy123@gmail.com"], ["id", 1]]
---
    def update
        @user = User.find(params[:id])
        if @user.update(user_params)        #find user then use built in update method to make changes

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 4]]
---
    def destroy
        @user = User.find(params[:id])     #finds user via id
        @user.destroy                      #calls built in destory method